// קונסט פרימטיבי  ,קבוע שאם ננסה לשנות אותו נקבל שגיאה פטאלית
// ונהוג לכתוב את השם משתנה/קבוע פרימטיב באותיות גדולות
const START_LIVES = 5;

// קבוע של אובייקט כן מאפשר להוסיף תאים /מאפיינים לערוך מאפיינים/תאים
// ולמחוק
// אך אסור לייצר מערך חדש לגמרי בזכרון לקונסט
// ראו שורה 27 ו 29 מה שאסור לעשות
const abc_ar = ["A","b","c"];

const car1_obj = {
  name:"mazda",
  color:"blue"
}


function init(){
  // נקבל שגיאה אם ננסה לשנות אותו
  // START_LIVES = 10;

  abc_ar.push("d"); 
  abc_ar[0] = "z";

  car1_obj.km = 333333

  // לא ניתן כי אנחנו מנסים ליישם אותו מחדש בתא חדש בזכרון
  // car1_obj = {name:"ferrari"};
  // לא ניתן להגדיר קונסט של אובייקט כמערך/אובייקט חדש
  // abc_ar = ["d","e","f"];
  console.log(abc_ar);
  console.log(car1_obj);

  console.log(START_LIVES);
}



init();